tmux/.tmux.conf
# Mouse
# Enable mouse marking

# [[file:README.org::*Mouse][Mouse:1]]
set -g mouse on
# Mouse:1 ends here

# Set leader key

# [[file:README.org::*Set leader key][Set leader key:1]]
set-option -g prefix C-a
# Set leader key:1 ends here

# Make it possible to repeat to send it further down

# [[file:README.org::*Make it possible to repeat to send it further down][Make it possible to repeat to send it further down:1]]
unbind-key C-a
bind-key C-a send-prefix
set -g base-index 1
# Make it possible to repeat to send it further down:1 ends here

# Actions

# [[file:README.org::*Actions][Actions:1]]
bind-key : command-prompt
bind-key v split-window -h
bind-key s split-window -v
bind-key h select-pane -L
bind-key j select-pane -D
bind-key k select-pane -U
bind-key l select-pane -R
# Actions:1 ends here

# Toggle full screen

# [[file:README.org::*Toggle full screen][Toggle full screen:1]]
unbind-key f
bind-key f resize-pane -Z
# Toggle full screen:1 ends here

# Select pane

# [[file:README.org::*Select pane][Select pane:1]]
bind-key -n M-h select-pane -L
bind-key -n M-j select-pane -D
bind-key -n M-k select-pane -U
bind-key -n M-l select-pane -R
bind-key -n M-Left select-pane -L
bind-key -n M-Down select-pane -D
bind-key -n M-Up select-pane -U
bind-key -n M-Right select-pane -R
# Select pane:1 ends here

# Changing window

# [[file:README.org::*Changing window][Changing window:1]]
bind-key -n M-1 select-window -t 1
bind-key -n M-2 select-window -t 2
bind-key -n M-3 select-window -t 3
bind-key -n M-4 select-window -t 4
bind-key -n M-5 select-window -t 5
bind-key -n M-6 select-window -t 6
bind-key -n M-7 select-window -t 7
bind-key -n M-8 select-window -t 8
bind-key -n M-9 select-window -t 9
bind-key -n M-0 select-window -t 0
# Changing window:1 ends here

# Create new window

# [[file:README.org::*Create new window][Create new window:1]]
bind-key -n M-c new-window
bind-key -n M-Enter new-window
# Create new window:1 ends here

# Create new pane

# [[file:README.org::*Create new pane][Create new pane:1]]
bind-key -n M-v split-window -h
bind-key -n M-s split-window -v
# Create new pane:1 ends here

# Kill pane

# [[file:README.org::*Kill pane][Kill pane:1]]
bind-key -n M-d kill-pane
# Kill pane:1 ends here

# Kill window

# [[file:README.org::*Kill window][Kill window:1]]
bind-key -n M-q kill-window
# Kill window:1 ends here

# Position

# [[file:README.org::*Position][Position:1]]
set -g status-position top
# Position:1 ends here

# Colors

# [[file:README.org::*Colors][Colors:1]]
set -g status-bg 'colour0'
set -g status-fg 'white'
# Colors:1 ends here
